import 'package:flutter/material.dart';

class NandaKumarshatakam extends StatelessWidget {
  const NandaKumarshatakam({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        elevation: 5,
        title: Column(
          children: [
            Text(
              "श्री नंदकुमाराष्टकं",
              style: Theme.of(context).textTheme.titleLarge,
            ),
            Text("व्रजविलास हवेली",
                style: Theme.of(context).textTheme.displaySmall)
          ],
        ),
        centerTitle: true,
      ),
      body: Container(
        alignment: Alignment.center,
        height: MediaQuery.of(context).size.height,
        color: Colors.amber[100],
        child: SingleChildScrollView(
          child: Stack(
            children: [
              // // Image.asset("assets/images/Untitled design.png",
              //     fit: BoxFit.scaleDown),
              Text(
                  textAlign: TextAlign.center,
                  style: Theme.of(context).textTheme.bodyMedium,
                  '''


सुन्दर गोपालं उरवनमालं नयन विशालं दुःख हरं,
वृन्दावन चन्द्रं आनंदकंदं परमानन्दं धरणिधरं ।
वल्लभ घनश्यामं पूरण कामं अत्यभिरामं प्रीतिकरं,
भज नंद कुमारं सर्वसुख सारं तत्वविचारं ब्रह्मपरम ॥१॥

सुन्दरवारिज वदनं निर्जितमदनं आनन्दसदनं मुकुटधरं,
गुंजाकृतिहारं विपिनविहारं परमोदारं चीरहरम ।
वल्लभ पटपीतं कृतउपवीतं करनवनीतं विबुधवरं,
भज नंद कुमारं सर्वसुख सारं तत्वविचारं ब्रह्मपरम ॥२॥

शोभित मुख धूलं यमुना कूलं निपट अतूलं सुखदतरं,
मुख मण्डित रेणुं चारित धेनुं बाजित वेणुं मधुर सुरम ।
वल्लभ अति विमलं शुभपदकमलं नखरुचि अमलं तिमिरहरं,
भज नंद कुमारं सर्वसुख सारं तत्वविचारं ब्रह्मपरम ॥३॥

शिर मुकुट सुदेशं कुंचित केशं नटवरवेशं कामवरं,
मायाकृतमनुजं हलधर अनुजं प्रतिहदनुजं भारहरम ।
वल्लभ व्रजपालं सुभग सुचालं हित अनुकालं भाववरं,
भज नंद कुमारं सर्वसुख सारं तत्वविचारं ब्रह्मपरम ॥४॥

इन्दीवरभासं प्रकट्सुरासं कुसुमविकासं वंशीधरं,
हृतमन्मथमानं रूपनिधानं कृतकलिगानं चित्तहरं ।
वल्लभ मृदुहासं कुंजनिवासं विविधविलासं केलिकरं,
भज नंद कुमारं सर्वसुख सारं तत्वविचारं ब्रह्मपरम ॥५॥

अति परं प्रवीणं पालितदीनं भक्ताधीनं कर्मकरं,
मोहन मतिधीरं फणिबलवीरं हतपरवीरं तरलतरं ।
वल्लभ व्रजरमणं वारिजवदनं जलधरशमनं शैलधरं,
भज नंद कुमारं सर्वसुख सारं तत्वविचारं ब्रह्मपरम ॥६॥

जलधरद्युतिअंगं ललितत्रिभंगं बहुकृतिरंगं रसिकवरं,
गोकुलपरिवारं मदनाकारं कुंजविहारं गूढनरम ।
वल्लभ व्रजचन्दं सुभग सुचन्दं कृताअनन्दं भ्रांतिहरं,
भज नंद कुमारं सर्वसुख सारं तत्वविचारं ब्रह्मपरम ॥७॥

वंदित युग चरणं पावन करणं जगत उद्धरणं विमलधरं,
कालिय शिर गमनं कृत फणिनमनं घातित यमनं मृदुलतरं ।
वल्लभ दुःखहरणं निरमलचरणं अशरण शरणं मुक्तिकरं,
भज नंद कुमारं सर्वसुख सारं तत्वविचारं ब्रह्मपरम ॥८॥

॥ इति श्रीमद वल्लभाचार्य विरचितं नन्दकुमाराष्टकं समाप्तं ॥
'''),
            ],
          ),
        ),
      ),
    );
  }
}
