import 'package:flutter/material.dart';

class NirodhLakshan extends StatelessWidget {
  const NirodhLakshan({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        elevation: 5,
        title: Column(
          children: [
            Text(
              "निरोधलक्षण",
              style: Theme.of(context).textTheme.titleLarge,
            ),
            Text("व्रजविलास हवेली",
                style: Theme.of(context).textTheme.displaySmall)
          ],
        ),
        centerTitle: true,
      ),
      body: Container(
        alignment: Alignment.center,
        height: MediaQuery.of(context).size.height,
        color: Colors.amber[100],
        child: SingleChildScrollView(
          child: Stack(
            children: [
              // // Image.asset("assets/images/Untitled design.png",
              //     fit: BoxFit.scaleDown),
              Text(
                  textAlign: TextAlign.center,
                  style: Theme.of(context).textTheme.bodyMedium,
                  '''


यच्च दुःखं यशोदाया नन्दादीनां च गोकुले।
गोपिकानां तु यद्‌दुःखं स्यान्मम क्वचित्‌॥१॥

गोकुले गोपिकानां च सर्वेषां व्रजवासिनाम्‌।
यत्सुखं समभूत्तन्मे भगवान्‌ किं विधास्यति॥२॥

उद्धवगमने जात उत्सवः सुमहान्‌ यथा।
वृन्दावने गोकुले वा  तथा मे मनसि क्वचित्‌॥३॥

महतां कृपयां यावद्‌ भगवान्‌ दययिष्यति।
तावदानन्दसन्दोहः कीर्त्यमानः सुखाय हि॥४॥

महतं कृपया यद्वत्‌ कीर्त्तनं सुखदं सदा।
न तथा लौकिकानां तु स्निग्धभिजनरुक्षवत॥५॥

गुणगाने सुखावाप्तिर्गोव्न्दस्य प्रजायते।
यथा तथा शुकादीनां नैवात्मनि कुतोsन्यतः॥६॥

क्लिश्यमानाच्जनान्‌ दृष्ट्‌वा कृपायुक्तो यदा भवेत्‌।
तदा सर्वं सदानन्दं हृदिस्थं निर्गतं बहिः॥७॥

सर्वानन्दमयस्यापि कृपानन्दः सुदुर्लभः।
हृद्‌गतः स्वगुणान्‌ श्रुत्वा पूर्णः प्लावयते जनान्‌॥८॥

त्स्मात्सर्वं परियज्य निरुद्धैः सर्वदा गुणाः।
सदानन्दपरैर्गेयाः सच्चिदानन्दता ततः॥९॥

अहं निरुद्धो रोधेन निरोधपदवीं गतः।
निरुद्धानं तु रोधायः निरोधं वर्णयामिते॥१०॥

हरिणा ये विनिर्मुक्तास्ते मग्ना भवसागरे।
ये निरुद्धास्त एवात्र मोदमायान्त्यहरिनिशम्‌॥११॥

संसारावेशदुष्टानामिन्द्रियाणां हिताय वै।
कृष्णस्य सर्ववस्तूनि भूम्न ईशस्य योजयेत्‌॥१२॥

गुणेष्वाविष्टचित्तानां सर्वदा मुरवैरिणः।
संसारविरहक्लेशौ न स्यातां हरिवत्सुखम्‌॥१३॥

तदा भवेद्‌दयालुत्वमन्यथा क्रूरता मता।
बाधशंकापि नास्त्यत्र तदध्यासोsपि सिद्धयति॥१४॥

भगवद्धर्म सामर्थ्यादिरागो विषये स्थिरः।
गुणैहरेः सुखस्पर्शान्न दुःखं भाति कर्हिचित्‌॥१५॥

एवं ज्ञात्वा ज्ञानमार्गादुत्कर्षं गुणवर्णने।
अमत्सरैरलुब्धैश्च वर्णनीयाः सदा गुणाः॥१६॥

हरिमूर्तिः सदा ध्येया संकल्पादपि तत्र हि।
दर्शनं स्पर्शनं स्पष्टं तथा कृतिगति सदा॥१७॥

श्रवणं कीर्त्तनं स्पष्टं पुत्रे कृष्णाप्रिये रतिः।
पायोर्मलांशत्यागेन शेषभागं तनौ नयेत्‌॥१८॥

यस्य वा भगवत्कार्य यदा स्पष्टं न दृश्यते।
तदा विनिग्रहस्तस्य कर्त्तव्य इति निश्चयः॥१९॥

नातः परतरो मन्त्रो नातः परतरः स्तवः।
नातः परतरा विद्या तीर्थं नातः परात्परम्‌॥२०॥
'''),
            ],
          ),
        ),
      ),
    );
  }
}
