import 'package:flutter/material.dart';

class PushtiPravahMaryada extends StatelessWidget {
  const PushtiPravahMaryada({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        elevation: 5,
        title: Column(
          children: [
            Text(
              "पुष्टिप्रवाहमर्यादा",
              style: Theme.of(context).textTheme.titleLarge,
            ),
            Text("व्रजविलास हवेली",
                style: Theme.of(context).textTheme.displaySmall)
          ],
        ),
        centerTitle: true,
      ),
      body: Container(
        alignment: Alignment.center,
        height: MediaQuery.of(context).size.height,
        color: Colors.amber[100],
        child: SingleChildScrollView(
          child: Stack(
            children: [
              // // Image.asset("assets/images/Untitled design.png",
              //     fit: BoxFit.scaleDown),
              Text(
                  textAlign: TextAlign.center,
                  style: Theme.of(context).textTheme.bodyMedium,
                  '''


पुष्टिप्रवाह मर्यादा विशेषेण पृथक पृथक।
जीव-देह-क्रियाभेदैः प्रवाहेण फलेन च॥१॥

वक्ष्यामि सर्वसन्देहा न भविष्यन्ति यच्छुतेः।
भक्तिमार्गस्यकथनात पुष्तिरस्तीति निश्चयः॥२॥

“द्वौ भूतसर्गा” वित्युक्तेः प्रवाहोSपि व्यवस्थितः।
वेदस्य विद्यमानत्वान्मर्यादापि व्यवथिता ॥३॥

कश्चितदेव हि भक्तो हि “यो मद्भक्त” इतीरणात।
सर्वत्रोत्कर्षकथनात पुष्टिरस्तीति निश्चयः॥४॥

न सर्वोतः प्रवाहादि भिन्नोवेदाच्च भेदतः।
“यदा यस्ये” ति वचना “न्नाहंवेदै” रितीरणात॥५॥

मार्गैकत्वेपि चेदन्त्यौ तनू भक्तयागमौ मतौ।
न तद्युक्तं सूत्रतोहि भिन्नौ युक्तया हि वैदिकः॥६॥

जीवदेहकृतीनां च भिन्नत्वं नित्यता श्रुतेः।
यथा तद्वत्पुष्टिमार्गे द्वयोरपि निषेधतः॥७॥

प्रमाण्भेदाद्भिन्नोहि पुष्टिमार्गो निरूपितः।
सर्गभेदं प्रवक्ष्यामि स्वरूपांगक्रियायुतम॥८॥

इच्छामात्रेण मनसा प्रवाहं सृष्टवान हरिः।
वचसा वेदमार्ग हि पुष्टिः कायेन निश्चयः॥९॥

मूलेच्छातः फलं लिके वेदोक्तं वैदिकेपि च।
कामेन तु फलं पुष्टौ निजेच्छातोsपि नैकता॥१०॥

“तानहं द्विषतो” वाक्याद्भिन्ना जीवाः प्रवाहिणः।
अत एवेतरौ भिन्नौ सान्तौ मोक्षप्रवेशतः॥११॥

तस्माज्जीवाः पुष्टिमार्गे भिन्ना एव न संशयः।
भगवदरूप सेवार्थं तत्सृष्टिर्नान्यथा भवेत॥१२॥

स्वरूपेणावतारेण लिंगेन च गुणेन च।
तारतम्यं न स्वरूपे देहे वा तत्क्रियासु वा॥१३॥

तथापि यावता कार्य तावत्त्स्य करोति हि।
ते हि द्विधा शुद्धमिश्रभेदान्मिश्रास्त्रिधा पुन॥१४॥

प्रवाहादिविभेदेन भगवतकार्यसिद्धये।
पुष्ट्याविमिश्राः सर्वज्ञाः प्रवाहेण क्रियारताः॥१५॥

मर्यादया गुणज्ञास्ते शुद्धाः प्रेम्णातिदुर्लभाः।
एवं सर्गस्तु तेषां हि फलं त्वत्र निरूप्यते॥१६॥

भगवानेव हि फलं स यथाssविर्भवेद्भुवि।
गुणस्वरूपभेदेन तथा तेषां फलं भवेत॥१७॥

आसक्तौ भगवानेव शापं दापयति क्वचित।
अहंकारेsथवा लोके तन्मार्गस्थापनाय हि॥१८॥

न ते पाषण्डतांयान्ति न च रोगाद्युपद्रवाः।
महानुभावाः प्रायेण शास्त्रं शुद्धत्वहेतवे॥१९॥

भगवत्तारतम्येन तारतम्यं भजन्ति हि।
वैदिकत्वं लौकिकत्वं कापट्यात्तेषु नान्यथा॥२०॥

वैष्णवत्वं हि सहजं ततोsन्यत्र विपर्ययः।
सम्बन्धिनस्तु ये जीवाः प्रवाहस्थास्तथाsपरे॥२१॥

चर्षणीशब्दवाच्यास्ते ते सर्वे सर्ववतर्मसु।
क्षणात्सर्वत्वमायान्ति रुचिस्तेषां न कुत्रचित॥२२॥

तेषां क्रियानुसारेण सर्वत्र शकलं फलं।
प्रवाहस्थान प्रवक्ष्यामि स्वरूपांगक्रियायुतान॥२३॥

जीवास्ते ह्मासुराः सर्वे “प्रवृत्तिं चेति” वर्णिताः।
ते च द्विधा प्रकीतर्यन्ते ह्मज्ञदुर्ज्ञविभेदतः॥२४॥

दुर्ज्ञास्ते भगवत्प्रोक्ता ह्मज्ञास्ताननु ये पुनः।
प्रवाहेपि समागत्य पुष्टिस्थस्तैर्न युज्यते॥
सोsपिस्तैस्तत्कुले जातः कर्मणा जायते यतः॥२५॥

॥इति श्रीमद वल्लभाचार्य विरचितः पुष्टिप्रवाहमर्यादाभेदः सम्पूर्ण॥

'''),
            ],
          ),
        ),
      ),
    );
  }
}
