import 'package:flutter/material.dart';

class SanyasNirnya extends StatelessWidget {
  const SanyasNirnya({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        elevation: 5,
        title: Column(
          children: [
            Text(
              "सन्यासनिर्णय",
              style: Theme.of(context).textTheme.titleLarge,
            ),
            Text("व्रजविलास हवेली",
                style: Theme.of(context).textTheme.displaySmall)
          ],
        ),
        centerTitle: true,
      ),
      body: Container(
        alignment: Alignment.center,
        height: MediaQuery.of(context).size.height,
        color: Colors.amber[100],
        child: SingleChildScrollView(
          child: Stack(
            children: [
              // // Image.asset("assets/images/Untitled design.png",
              //     fit: BoxFit.scaleDown),
              Text(
                  textAlign: TextAlign.center,
                  style: Theme.of(context).textTheme.bodyMedium,
                  '''


पश्चात्तपनिवृत्यर्थं परित्यागो विचार्यते।
स मार्गाद्वितये प्रोक्तो भक्तौ ज्ञाने विशेषतः॥१॥

कर्म मार्गे न कर्त्तव्यः सुतरां कलिकालतः।
अत आदौ भक्तिमार्गे कर्त्तव्यत्वाद्विचारणा॥२॥

श्रवणादिप्रसिद्धयर्थं कर्त्तव्यश्चेत्स नेष्यते।
सहाय संग साध्यत्वात्साधनानां च रक्षणात्‌॥३॥

अभिमानान्नियोगाच्च तद्‌धर्मैश्च विरोधतः।
गृहादेर्बाधकत्वेन साधनार्थं तथा यदि॥४॥

अग्रेsपि तादृशैरेव संगो भवति नान्यथा।
स्वयंच विषयाक्रान्तः पाषण्डी स्यात्तु कालतः॥५॥

विषयाक्रांत देहानां नावेशः सर्वथा हरेः।
अतोsत्र साधने भक्तौ नैव त्यागः सुखावहः॥६॥

विरहानुभवार्थ तु परित्यागः प्रशस्यते।
स्वीयबन्धनिवृत्यर्थं वेषः सोsत्र न चान्यथा॥७॥

कौण्डिन्यो गोपिकाः प्रोक्ता गुरवः साधनं च तत्‌।
भावो भावनया सिद्धः साधनं नान्यदिष्यते॥८॥

विकलत्वं तथाsस्वास्थ्यं प्रकृतिः प्राकृतं नहि।
ज्ञानं गुणाश्च तस्यैवं वर्त्तमानस्य बाधकाः॥९॥

सत्यलोके स्थितिर्ज्ञानात्संन्यासेन विशेषितात्‌।
भावना साधनं यत्र फलं चापि तथा भवेत्‌॥१०॥

तादृशाः सत्यलोकदौ  तिष्ठन्त्येव न संशयः।
बहिश्चेत्प्रकटः स्वात्मा वहिवत्प्रविशेद्यदि॥११॥

तदैव सकलोबन्धो नाशमेति न चान्यथा।
गुणास्तुसंगराहित्याज्जीवनार्थं भविन्ति हि॥१२॥

भगवान्‌ फलरूपत्वान्नात्र बाधक इष्यते।
स्वास्थ्यवाक्यं न कर्त्तव्यं दयालुर्न विरुद्धयेत॥१३॥

दुर्लभोsयं परित्यागः प्रेरणा सिद्धयति नान्यथा।
ज्ञानमार्गे तु सन्यासो द्विविधोsपि विचारितः॥१४॥

ज्ञानार्थमुत्तराग्ङञ्च सिद्धिर्जन्मशतैः परम्‌।
ज्ञानं च साधनापेक्षं यज्ञादिश्रवणान्मतम्‌॥१५॥

अतः कलौ स सन्यासः पश्चात्तापाय नान्यथा।
पाषण्डित्वं भवेच्चापि तस्माज्जाने न सन्यसेत्‌॥१६॥

सुतरां कलिदोषाणां प्रबलत्वादिति स्थितम्‌।
भक्तिमार्गेपिचेद्दोषस्तदा किं कार्यमुच्यते॥१७॥

अत्रारम्भे न नाशः स्याद्‌ दृष्टान्तस्याप्यभावतः।
स्वास्थ्यहेतोः परित्यागाद्‌ बाधः केनास्य संभवेत्‌॥१८॥

हरिरत्र न शक्नोति कर्तु बाधां कुतोsपरे।
अन्यथा मातरो बालान्‌ न स्तन्यैः पुपुषुः क्वचित्‌॥१९॥

“ज्ञानिनामपि” वाक्येन न भक्तं मोहयिष्यति।
आत्मप्रदः प्रियश्चापि किमर्थं मोहयोष्यति॥२०॥

तस्मादुक्तप्रकारेण परित्यागो विधीयताम्‌।
अन्यथा भ्रश्यते स्वार्थादिति में निश्चता मतिः॥२१॥

इति कृष्णप्रसादेन वल्लभेन विनिश्चतम्‌।
सन्यासावरणं भक्तावन्यथा पतितो भवेत्‌॥२२॥

॥इति श्रीवल्लभाचार्यविरचितः सन्यासनिर्णयः समाप्तः॥
'''),
            ],
          ),
        ),
      ),
    );
  }
}
