import 'package:flutter/material.dart';

class SarvottamGujarati extends StatelessWidget {
  const SarvottamGujarati({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        elevation: 5,
        title: Column(
          children: [
            Text(
              "सर्वोत्तम स्तोत्र (गुजराती धौल)",
              style: Theme.of(context).textTheme.titleLarge,
            ),
            Text("व्रजविलास हवेली",
                style: Theme.of(context).textTheme.displaySmall)
          ],
        ),
        centerTitle: true,
      ),
      body: Container(
        alignment: Alignment.center,
        height: MediaQuery.of(context).size.height,
        color: Colors.amber[100],
        child: SingleChildScrollView(
          child: Stack(
            children: [
              // // Image.asset("assets/images/Untitled design.png",
              //     fit: BoxFit.scaleDown),
              Text(
                  textAlign: TextAlign.center,
                  style: Theme.of(context).textTheme.bodyMedium,
                  '''


भले प्रकट्या श्री वल्लभदेव, श्री पुरुषोत्तम भूतल फरी जी।
नही प्राकृत धर्मनो लेश, अप्राकृत निज वपु धरी जी॥१॥

करे निगम निरूपण एम ते साकारनी स्तुति करी जी।
महा कलिकालदिक दोष, पंडित नी दृष्टि तिमीर भरी जी॥२॥

महिमा नव जाणे जेह, ते कहिये खरा सुर अरि जी।
वहाले दया करी मुख रूप, निज लीला प्रकट करी जी॥३॥

जेनी वाणी अति दुर्बोध, थाय सुबोध जेणे करी जी।
जेना अष्टोत्तर शत नाम, ते कहिये महा अघ हरी जी॥४॥

जेना ऋषिवर अग्निकुमार, जगती छंद नामे धरी जी।
श्री कृष्ण कमल मुख देव, बीज दृष्टी करुणा भरी जी॥५॥

जेनी भक्तिमां अंतराय, ते नाशनुं प्रयिजन सही जी।
आपे अधरामृतनी सिद्धि, ते मध्ये निश्चय करी जी॥६॥

|| ढाल ||

वहालो आनंद परमानंद कहेवाय, 
श्री कृष्ण कमल मुख कृपानिधि थाय॥७॥

वहालो दैवी उद्धारण प्रयत्न उपाय, 
जेना स्मरण मात्रथी आरती थाय ॥८॥

श्री भागवत गूढार्थ प्रकटाय,
 साकार ब्रह्मनो वाद स्थपाय॥९॥

वेद पारंग चौदह भुवन कहेवाय, 
मायावाद निराकृत सहु मली गाय॥१०॥

सर्व वादी निरास कीधा ते लखाय, 
भक्ति मार्ग सरस कमल विकसाय॥११॥

स्त्री शूद्रादिकने उद्धारवा समर्थ, 
जेना साधन बलथी न थाये अनर्थ॥१२॥

अंगीकार मात्रथी सर्व स्वकीये,
कीधा श्रीगोपीजन पतिने प्रिये॥१३॥

अंगीकार करे मर्यादा अनुसार ,
महा करुणावंत समर्थ अपार॥१४॥

वहालो अदेय दान देवाने चतुर ,
महा उदार चरित्र करे बहुपुर॥१५॥

लीला देखाडी प्राकृतनी जेह ,
ते विषे मोह्या सुर रिपु तेह॥१६॥

वैश्वानर श्री वल्लभ छे नाम , 
वहालो सुन्दर रूप स्वजन हित काम॥१७॥

कृष्ण भक्ति करे जन शिक्षा काज,
आपे अखिल इष्ट श्री वल्लभराज॥१८॥

सर्व लक्षण थी सम्पन्न विवेक,
श्री कृष्ण ज्ञा्नदाता गुरु एक॥१९॥

पोताना आनंद थकी बहु पुष्ट,
एना कमल पत्र सा नेत्र संतुष्ट॥२०॥

कृपा दृष्टि नो वृष्टि थी हरख्या मन,
ते दास दासी प्रिय पतिने अनन्य॥२१॥

रोष दृष्टि करे भक्ति शत्रु प्रजाल, 
भक्त सेवंता सुख सेवा रसाल॥२२॥

एमनी भक्तो बिना नही सेवा साध्य,
ते कारण थी कहिए दुराराध्य॥२३॥

जेना चरण सरोज दुर्लभ दरशाय,
तेना उग्र प्रताप त्रैलोकमा कहेवाय॥२४॥

वचनामृत करी पूर्या सेवकना अर्थ,
श्री भागवत अमृत मथन समर्थ॥२५॥

तेनो सार कहीए ब्रज सुंदरी नो भाव,
ते परिपूर्ण छे देह भराव॥२६॥

सान्निध्य मात्र करे कृष्ण प्रेम,
भक्ति मुक्ति देवानु एहने नेम॥२७॥

एक रासलीलामां तेमनुं तान,
प्रभु कृपा करी ने करे कथानुं दान॥२८॥

वहालो विरहना अनुभवने हित काज,
सर्व त्याग जणाव्यो श्री वल्लभराज॥२९॥

उपदेश कर्यो भक्तोमार्ग आचार,
लोकमाहे जणाव्यो कर्ममार्ग प्रचार॥३०॥

वेद शास्त्र कह्यां यज्ञादिक दान,
तेनु फल मर्यादा भक्ति निदान॥३१॥

प्रभु पूर्णनंद छे पूरण काम,
सरस्वति ना पति देव ईश अभिराम ॥३२॥

वहाले सहस्त्र कह्यां पुरुषोत्तम नाम,
निजजननो आश्रयनुं छे धाम॥३३॥

भक्तिमार्गनी रीत करवा उपदेश,
बहु ग्रंथ करीने टाल्यो संशयनो लेश॥३४॥

जेने पामवाने छोड्या प्राणथी प्रिये,
एवा भक्त समाज बिराजे श्रीये॥३५॥

आप साधन करे निज दासने काज,
एवा समर्थ श्री वल्लभ महाराज॥३६॥

करवा भक्ति प्रचार भूतल माही,
वंश कीधा पिता थईने ग्रही बांही॥३७॥

सर्व सामर्थ्य धर्युं पोताने वंश,
गर्व दूर करी टाल्यो संशय नो अंश॥३८॥

प्रभु पतिव्रताना पति साक्षात,
करे परलोक दान विख्यात॥३९॥

जेना अंतःकरण छे गूढ अपार,
अंगीकृतने जणाव्यो मननो विचार॥४०॥

उपासनादिक मारग जे अन्य,
तेनो मोह टाली ने कीधा सेवक अनन्य॥४१॥

कर्यो निश्चय जे भक्ति सर्वथी विशेष,
कीधो शरण मार्गनो जुदो उपदेश॥४२॥

श्री कृष्णना मननी जाणे वात,
लीला कुंज बिहारी परिपूरण गात॥४३॥

कथारस मग्न सद छे चित्त ,
विसर्यु सौ ते थकी बीजूं वित्त॥४४॥

प्रिय छे घणुं व्रज ने व्रज नो वास,
करे पुष्टिलीला एकांत विलास॥४५॥

करे भक्त इच्छा परिपूरण दान,
नही निज लीला नु कोई ने ज्ञान॥४६॥

अति मोहित जेनुं शील घणों,
नहि लोक विषे आसक्ति अणुं॥४७॥

निज भक्त विषे आसक्ति छे एक,
प्रभु पावन कीधा पतित अनेक॥४८॥

जे करे पोताना गुणनुं गान,
तेना हृदय कमल रहेवानु स्थान ॥४९॥

निज यशरूपी अमृत लहरि,
तेथी भीजवी सर्व रस वासना हरी॥५०॥

प्रभु पोते सर्व थकी छे पर,
न करे तुल्यता कोई अवर॥५१॥

लीलारस अमृत तरंग बहु,
भीज्व्या छे भक्त शरीर सहु ॥५२॥

रुचि आपे गिरि गोवर्धन वास,
ते लीला मां छे अतिशय उल्लास॥५३॥

करे यज्ञ भोग ने यज्ञ कर्म,
आपे अर्थ कामने मोक्ष धर्म॥५४॥

प्रभु सत्य वचन छे त्रिगुणातीत,
नीति चतुराई छे अति अगणित॥५५॥

करवा पोतानी कीर्ति प्रकाश,
कर्युं व्याससूत्रनुं नूतन भाष्य॥५६॥

अति तुच्छ तुल जे मायावाद,
करि भस्माग्नि स्थाप्यो ब्रह्मवाद॥५७॥

अप्राकृत भूषणनी अति कांति,
हसतां मुख शोभे छे बहु भांति॥५८॥

प्रभु त्रण लोकना भूषणसार,
प्रकट्या धरणी नुं भाग्य अपार॥५९॥

प्रभु सुंदरता छे अतिरी अनूप,
केम वर्णन करी सकूं ए स्वरूप॥६०॥

सौ मांगे छे पोताना जन,
चरणारविंद नी रज जे धन॥६१॥

ए कह्या एकसोने आठे नाम,
श्री वल्लभ आनंदनुं छे धाम ॥६२॥

||वलण ||

जे कोई श्रद्धा करी नित्य गाय रे,
तेनु मन पहेलुं स्थिर थाय रे ॥६३॥

अधरामृतनी सिद्धि पामे रे,
तेमा संशय नु नही नाम रे॥६४॥

ए पाम्या बिना मोक्ष छे हीन रे,
तेना फलमां मुक्ति छे लीन रे॥६५॥

तेथी सर्वोत्तम जप करवो रे,
श्री कृष्ण रसे मन भरवो रे॥६६॥

श्री विट्ठल उच्चरित ए नाम रे,
जे कोई गाये पूरे तेना काम रे॥६७॥

तेनो जन्म सफल करी लेखे रे,
ते श्री व्रजभूषणजीना सुख देखे रे॥६८॥
'''),
            ],
          ),
        ),
      ),
    );
  }
}
