import 'package:flutter/material.dart';

class SarvottamStrotam extends StatelessWidget {
  const SarvottamStrotam({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        elevation: 5,
        title: Column(
          children: [
            Text(
              "सर्वोत्तम स्तोत्र (संस्कृत)",
              style: Theme.of(context).textTheme.titleLarge,
            ),
            Text("व्रजविलास हवेली",
                style: Theme.of(context).textTheme.displaySmall)
          ],
        ),
        centerTitle: true,
      ),
      body: Container(
        alignment: Alignment.center,
        height: MediaQuery.of(context).size.height,
        color: Colors.amber[100],
        child: SingleChildScrollView(
          child: Stack(
            children: [
              // // Image.asset("assets/images/Untitled design.png",
              //     fit: BoxFit.scaleDown),
              Text(
                  textAlign: TextAlign.center,
                  style: Theme.of(context).textTheme.bodyMedium,
                  '''


प्राकृत धर्मानाश्रयम प्राकृत निखिल धर्म रूपमिति ।
निगम प्रतिपाद्यमं यत्तच्छुद्धं साकृत सतौमि ॥१॥ 

कलिकाल तमश्छन्न दृष्टित्वा द्विदुषामपि ।
संप्रत्य विषयस्तस्य माहात्म्यं समभूदभुवि॥२॥

दयया निज माहात्म्यं करिष्यन्प्रकटं हरिः ।
वाण्या यदा तदा स्वास्यं प्रादुर्भूतं चकार हि ॥३॥

तदुक्तमपि दुर्बोधं सुबोधं स्याद्यथा तथा ।
तन्नामाष्टोरतरशतं प्रवक्ष्याम्यखिलाघहृत ॥४॥

ऋषिरग्नि कुमारस्तु नाम्नां छ्न्दो जगत्यसौ ।
श्री कृश्णास्यं देवता च बीजं कारुणिकः प्रभुः ॥५॥

विनियोगो भक्तियोग  प्रतिबंध विनाशने ।
कृष्णाधरामृतास्वादसिद्धिरत्र न संशयः ॥६॥

आनंदः परमानंदः श्रीकृष्णस्यं कृपानिधिः ।
दैवोद्धारप्रयत्नात्मा स्मृतिमात्रार्तिनाशनः ॥७॥

श्री भागवत गूढार्थ प्रकाशन परायणः ।
साकार ब्रह्मवादैक स्थापको वेदपारगः ॥८॥

मायावाद निराकर्ता सर्ववाद निरासकृत ।
भक्तिमार्गाब्जमार्तण्डः स्त्रीशूद्राद्युदधृतिक्षमः ॥९॥

अंगीकृतयैव गोपीशवल्लभीकृतमानवः ।
अंगीकृतौ समर्यादो महाकारुणिको विभुः ॥१०॥

अदेयदानदक्षश्च महोदारचरित्रवान ।
प्राकृतानुकृतिव्याज मोहितासुर मानुषः ॥११॥

वैश्वानरो वल्लभाख्यः सद्रूपो हितकृत्सताम ।
जनशिक्षाकृते कृष्ण भक्तिकृन्न खिलेष्टदः ॥१२॥

सर्वलक्षण सम्पन्नः श्रीकृष्णज्ञानदो गुरुः ।
स्वानन्दतुन्दिलः पद्मदलायतविलोचनः ॥१३॥

कृपादृग्वृष्टिसंहृष्ट दासदासी प्रियः पतिः ।
रोषदृक्पात संप्लुष्टभक्तद्विड भक्त सेवितः ॥१४॥

सुखसेव्यो दुराराध्यो दुर्लभांध्रिसरोरुहः ।
उग्रप्रतापो वाक्सीधु पूरिता शेषसेवकः ॥१५॥

श्री भागवत पीयूष समुद्र मथनक्षमः ।
तत्सारभूत रासस्त्री भाव पूरित विग्रहः ॥१६॥

सान्निध्यम्मात्रदत्तश्रीकृष्णप्रेमा विमुक्तिदः ।
रासलीलैकतात्पर्यः कृपयैतत्कथाप्रदः ॥१७॥

विरहानुभवैकार्थसर्वत्यागोपदेशकः ।
भक्त्याचारोपदेष्टा च कर्ममार्गप्रवर्तकः॥१८॥

यागादौ भक्तिमार्गैक साधनत्वोपदेशकः ।
पूर्णानन्दः पूर्ण्कामो वाक्पतिर्विबुधेश्वरः ॥१९॥

कृष्णनामसहस्त्रस्य वक्ता भक्तपरायणः ।
भक्त्याचारोपदेशार्थ नानावाक्य निरूपकः ॥२०॥

स्वार्थो ज्झिताखिलप्राणप्रियस्तादृशवेष्टितः ।
स्वदासार्थ कृताशेष साधनः सर्वशक्तिधॄक ॥२१॥

भुवि भक्ति प्रचारैककृते स्वान्वयकृत्पिता ।
स्ववंशे स्थापिताशेष स्वमहात्म्यः स्मयापहः ॥२२॥

पतिव्रतापतिः पारलौकिकैहिक दानकृत ।
निगूढहृदयो नन्य भक्तेषु ज्ञापिताशयः ॥२३॥

उपासनादिमार्गाति मुग्ध मोह निवारकः ।
भक्तिमार्गे सर्वमार्ग वैलक्षण्यानुभूतिकृत ॥२४॥

पृथक्शरण मार्गोपदेष्टा श्रीकृष्णहार्दवित ।
प्रतिक्षण निकुंज स्थलीला रस सुपूरितः ॥२५॥

तत्कथाक्षिप्तचितस्त द्विस्मृतन्यो व्रजप्रियः ।
प्रियव्रजस्थितिः पुष्टिलीलाकर्ता रहः प्रियः ॥२६॥

भक्तेच्छापूरकः सर्वाज्ञात  लीलोतिमोहनः।
सर्वासक्तो भक्तमात्रासक्तः पतितपावनः ॥२७॥

स्वयशोगानसंहऋष्ठऋदयाम्भोजविष्टरः ।
यशः पीयूष्लहरीप्लावितान्यरसः परः ॥२८॥

लीलामृतरसार्द्रार्द्रीकृताखिलशरीरभृत ।
गोवर्धनस्थित्युत्साहल्लीला प्रेमपूरितः ॥२९॥

यज्ञभोक्ता यज्ञकर्ता चतुर्वर्ग विशारदः ।
सत्यप्रतिज्ञस्त्रिगुणोतीतो नयविशारदः ॥३०॥

स्वकीर्तिवर्द्धनस्तत्व सूत्रभाष्यप्रदर्शकः ।
मायावादाख्यतूलाग्निर्ब्रह्मवादनिरूपकः ॥३१॥

अप्राकृताखिलाकल्प भूषितः सहजस्मितः ।
त्रिलोकीभूषणं भूमिभाग्यं सहजसुन्दरः ॥३२॥

अशेषभक्त संप्रार्थ्य चरणाब्ज रजोधनः ।
इत्यानंद निधेः प्रोक्तां नाम्नामष्टोत्तरं शतम ॥३३॥

श्रृद्धाविशुद्ध बुद्धिर्यः पठत्यनुदिनं जनः ।
स तदेकमनाः सिद्धिमुक्तां प्राप्नोत्यसंशयम ॥३४॥

तदप्राप्तौ वृथा मोक्ष स्तदप्तौतदगतार्थता ।
अतः सर्वोत्तमं स्तोत्रं जप्यं कृष्ण रसार्थिभिः ॥३५॥

॥ इति श्रीमदग्निकुमारप्रोक्तं श्री सर्वोत्तमस्तोत्रं सम्पूर्णम ॥
                  '''),
            ],
          ),
        ),
      ),
    );
  }
}
