import 'package:flutter/material.dart';

class SidhhantMuktavali extends StatelessWidget {
  const SidhhantMuktavali({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        elevation: 5,
        title: Column(
          children: [
            Text(
              "सिद्धांतमुक्तावली",
              style: Theme.of(context).textTheme.titleLarge,
            ),
            Text("व्रजविलास हवेली",
                style: Theme.of(context).textTheme.displaySmall)
          ],
        ),
        centerTitle: true,
      ),
      body: Container(
        alignment: Alignment.center,
        height: MediaQuery.of(context).size.height,
        color: Colors.amber[100],
        child: SingleChildScrollView(
          child: Stack(
            children: [
              // // Image.asset("assets/images/Untitled design.png",
              //     fit: BoxFit.scaleDown),
              Text(
                  textAlign: TextAlign.center,
                  style: Theme.of(context).textTheme.bodyMedium,
                  '''


नत्वा हरिं प्रवक्ष्यामि स्वसिद्धांत विनिश्चयम।
कृष्ण सेवा सदा कार्या मानसी सा परा स्मृता॥१॥

चेतस्तस्प्रवणं सेवा तत्सिच्द्धयै तनुवित्तजा।
ततः संसारदुःखस्य निवृत्तिर्ब्रह्मबोधनम॥२॥

परं ब्रह्म तु कृष्णो हि सच्चिदानंदकं बृहत।
द्विरूपं तद्वि सर्वं स्यादेकं तस्माद्विलक्षणम॥३॥

अपरं तत्र पूर्वस्मिन वादिनो बहुधा जगुः।
मायिकं सगुणं कार्यं स्वतंत्र चेति नैकधा॥४॥

तदेवैतत्प्रकारेण भवतीति श्रुतेर्मतम।
द्विरूपं चापि गंगावज्ज्ञेयं सा जलरूपिणी॥५॥

माहात्म्यसंयुता नृणां सेवतांभुक्तिमुक्तिदा।
मर्यादामार्गविधिना तथाब्रह्मापि बुद्ध्यताम॥६॥

तत्रैव देवतामूर्तिर्भक्तया या हश्यते क्वचित।
गंगायांच विशेषेण प्रवाहाभेदबुद्धये॥७॥

प्रत्यक्षा सा न सर्वेषां प्राकाम्यं स्यात्तया जले।
विहिताच्च फलात्तद्धि प्रतीत्यापि विशिष्यते॥८॥

यथा जलं तथा सर्वं यथा शक्ता तथा बृहत।
यथा देवी तथा कृष्ण्स्तत्राप्येतदिहोच्यते॥९॥

जगत्तु त्रिविधं प्रोक्तं ब्रह्मविष्णुशिवास्ततः।
देवतारूपवत्प्रोक्ता ब्रह्मणीत्थं हरिर्मतः॥१०॥

कामचारस्तु लोकेस्मिब्रह्मदिभ्यो न चान्यथा ।
परमानन्दरूपे तु कृष्णे स्वात्मनि निश्चयः॥११॥

अतस्तु ब्रह्मवादेन कृष्णे बुद्धिर्विधीयताम।
आत्मनि ब्रह्मरूपे हि छिद्रा व्योम्नीव चेतनाः॥१२॥

उपाधिनाशे विज्ञाने ब्रह्मत्वत्वावबोधने।
गंगातीरस्थितो यद्वदेवतां तत्र पश्यति॥१३॥

तथा कृष्णं परं ब्रह्म स्वस्मिन ज्ञानी प्रपश्यति।
संसारी यस्तु भजते स दूरस्थो यथा तथा॥१४॥

अपेक्षित जलादीनामभावात्तत्र दुःखभाक।
तस्माच्छ्रीकृष्णमार्गस्थो विमुक्तः सर्वलोकतः॥१५॥

आत्मानंदसमुद्रस्थं कॄष्णमेव विचिन्तयेत।
लोकार्थी चेदभजेत कृष्णं क्लिष्टो भवति सर्वथा॥१६॥

क्लिष्टोपि चेदभजेत कॄष्णं लोको नश्यति सर्वथा।
ज्ञानाभावे पुष्टिमार्गी तिष्ठेत पूजोत्सवादिषु॥१७॥

मर्यादस्थस्तु गंगायां श्रीभगवततत्परः।
अनुग्रहः पुष्टिमार्गे नियामक इति स्थितिः॥१८॥

उभयोस्तु क्रमेणैव पूर्वोक्तैव फलिष्यति।
ज्ञानाधिको भक्तिमार्ग एवं तस्मान्निरूपितः॥१९॥

भक्तयभावे तु तीरस्थो यथा दुष्टैः स्वकर्मभिः।
अन्यथाभावनापन्नस्तस्मात्स्थानाच्च नश्यति॥२०॥

एवं स्वशास्त्रसर्वस्वं मया गुप्तं निरूपितम।
एतदवुध्वा विमुच्येत पुरुषः सर्वसंशयात॥२१॥

॥इति श्री वल्लभाचार्य विरचिता सिद्धांतमुक्तावली सम्पूर्ण॥
'''),
            ],
          ),
        ),
      ),
    );
  }
}
