import 'package:flutter/material.dart';

class VivekDhairyasshram extends StatelessWidget {
  const VivekDhairyasshram({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        elevation: 5,
        title: Column(
          children: [
            Text(
              "विवेकधैर्याश्रय",
              style: Theme.of(context).textTheme.titleLarge,
            ),
            Text("व्रजविलास हवेली",
                style: Theme.of(context).textTheme.displaySmall)
          ],
        ),
        centerTitle: true,
      ),
      body: Container(
        alignment: Alignment.center,
        height: MediaQuery.of(context).size.height,
        color: Colors.amber[100],
        child: SingleChildScrollView(
          child: Stack(
            children: [
              // // Image.asset("assets/images/Untitled design.png",
              //     fit: BoxFit.scaleDown),
              Text(
                  textAlign: TextAlign.center,
                  style: Theme.of(context).textTheme.bodyMedium,
                  '''


विवेकधैर्ये सततं रक्षरणीय तथाश्रयः
विवेकस्तु “हरिः” सर्व निजेच्छातः करिष्यति॥१॥

प्रार्थिते वा ततः किं स्यात्‌ स्वाम्यभिप्रायसंशयात्‌।
सर्वत्र तस्य सर्वं हि सर्वसामर्थ्यमेव च॥२॥

अभिमानस्य संत्याज्यः स्वाम्यधीनत्व भावनात्‌।
विशेतश्वे दाज्ञा स्यादन्तः करणगोचरा॥३॥

तदा विशेषगत्यादि भाव्यं भिन्नं तु दैहिकात्‌।
आपद्‌गत्यादिकार्येषु हठस्त्याज्यश्च सर्वथा॥४॥

अनाग्रहश्च सर्वत्र धर्माधर्माग्रदर्शनम्‌।
विवेकोsयं समाख्यातोधैर्यं तु विनिरूप्यते॥५॥

त्रिदुःखसहनं धैर्यमामृतेः सर्वतः सदा।
तक्रवद्भेहवभाव्यं जडवद्‌गोपभार्यवत्‌॥६॥

प्रतीकारो यद्‌च्छातः सिद्धश्चेन्नाग्रही भवेत्‌।
भार्यादीनां तथान्येषामसतश्चाक्रमं सहेत्‌॥७॥

स्वयमिन्द्रियकार्याणि कायवाङ्‌मनसा त्यजेत्‌।
अशूरेणपि कर्त्तव्यं स्वस्यासामर्थ्यभावनात्‌॥८॥

अशक्ये हरिरेवास्ति सर्वमाश्रयतोभवेत्‌।
एतत्सहनमत्रोक्त्तमाश्रयोsतो निरूपयेत॥९॥

एहिके पारलोके च सर्वथा शरणं हरिः।
दुःखहानौ तथा पापे भये कामद्यपूरणे॥१०॥

भक्तदोहे भक्तयभावे भक्तैश्‍चापि क्रमे कृते।
अशक्ये वा सुशवये वा सर्वथा शरणं हरिः॥११॥

अहंकार कृते चैव पोष्य पोषणरक्षणे।
पोष्यातिक्रमणे चैव तथान्तेवास्यतिक्रमे॥१२॥

अलौकिक मनः सिद्धौ सर्वार्थं शरणं हरिः।
एवं चित्ते सदा भाव्यं वाचा च परिकीर्तयेत्‌॥१३॥

अन्यस्य भजनं तत्र स्वतो गमन मेव च।
प्रार्थनाकार्य मात्रेsपि ततोsन्यत्र विवर्जयेत्‌॥१४॥

अविश्वासो न कर्त्तव्यः सर्वथा वाधकस्तु सः।
ब्रह्मास्त्र चातकौ भाव्यौ प्राप्तं सेवेत निर्ममः॥१५॥

यथाकथंचित्‌ कार्याणि कुर्यादुच्चावचान्यपि।
किंवा प्रोक्तेन बहुना शरणं भावयेद्भरिम्‌॥१६॥

एवमाश्रयणं प्रोक्तं सर्वेषां सर्वदा हितम्‌।
कलौ भक्तयादिमार्गा हि दुस्साध्या इति मे मतिः॥१७॥

॥ इति श्री वल्लभाचर्यप्रोक्तं विवैकधैर्याश्रयं सम्पूर्णम्‌ ॥
'''),
            ],
          ),
        ),
      ),
    );
  }
}
