import 'package:flutter/material.dart';

class Yamunashtak extends StatelessWidget {
  const Yamunashtak({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        elevation: 5,
        title: Column(
          children: [
            Text(
              "यमुनाष्टक",
              style: Theme.of(context).textTheme.titleLarge,
            ),
            Text("व्रजविलास हवेली",
                style: Theme.of(context).textTheme.displaySmall)
          ],
        ),
        centerTitle: true,
      ),
      body: Container(
        alignment: Alignment.center,
        height: MediaQuery.of(context).size.height,
        color: Colors.amber[100],
        child: SingleChildScrollView(
          child: Stack(
            children: [
              // // Image.asset("assets/images/Untitled design.png",
              //     fit: BoxFit.scaleDown),
              Text(
                  textAlign: TextAlign.center,
                  style: Theme.of(context).textTheme.bodyMedium,
                  '''


नमामि यमुनामहं सकल सिद्धि हेतुं मुदा
मुरारि पद पंकज स्फ़ुरदमन्द रेणुत्कटाम ।

तटस्थ नव कानन प्रकटमोद पुष्पाम्बुना
सुरासुरसुपूजित स्मरपितुः श्रियं बिभ्रतीम ॥१॥

कलिन्द गिरि मस्तके पतदमन्दपूरोज्ज्वला
विलासगमनोल्लसत्प्रकटगण्ड्शैलोन्न्ता ।

सघोषगति दन्तुरा समधिरूढदोलोत्तमा
मुकुन्दरतिवर्द्धिनी जयति पद्मबन्धोः सुता ॥२॥

भुवं भुवनपावनीमधिगतामनेकस्वनैः
प्रियाभिरिव सेवितां शुकमयूरहंसादिभिः ।

तरंगभुजकंकण प्रकटमुक्तिकावाकुका-
नितन्बतटसुन्दरीं नमत कृष्ण्तुर्यप्रियाम ॥३॥

अनन्तगुण भूषिते शिवविरंचिदेवस्तुते
घनाघननिभे सदा ध्रुवपराशराभीष्टदे ।

विशुद्ध मथुरातटे सकलगोपगोपीवृते
कृपाजलधिसंश्रिते मम मनः सुखं भावय ॥४॥

यया चरणपद्मजा मुररिपोः प्रियं भावुका
समागमनतो भवत्सकलसिद्धिदा सेवताम ।

तया सह्शतामियात्कमलजा सपत्नीवय-
हरिप्रियकलिन्दया मनसि मे सदा स्थीयताम ॥५॥

नमोस्तु यमुने सदा तव चरित्र मत्यद्भुतं
न जातु यमयातना भवति ते पयः पानतः ।

यमोपि भगिनीसुतान कथमुहन्ति दुष्टानपि
प्रियो भवति सेवनात्तव हरेर्यथा गोपिकाः ॥६॥

ममास्तु तव सन्निधौ तनुनवत्वमेतावता
न दुर्लभतमारतिर्मुररिपौ मुकुन्दप्रिये ।

अतोस्तु तव लालना सुरधुनी परं सुंगमा-
त्तवैव भुवि कीर्तिता न तु कदापि पुष्टिस्थितैः ॥७॥

स्तुति तव करोति कः कमलजासपत्नि प्रिये
हरेर्यदनुसेवया भवति सौख्यमामोक्षतः ।

इयं तव कथाधिका सकल गोपिका संगम-
स्मरश्रमजलाणुभिः सकल गात्रजैः संगमः ॥८॥

तवाष्टकमिदं मुदा पठति सूरसूते सदा
समस्तदुरितक्षयो भवति वै मुकुन्दे रतिः ।

तया सकलसिद्धयो मुररिपुश्च सन्तुष्यति
स्वभावविजयो भवेत वदति वल्लभः श्री हरेः ॥९॥

॥ इति श्री वल्लभाचार्य विरचितं यमुनाष्टकं सम्पूर्णम ॥
'''),
            ],
          ),
        ),
      ),
    );
  }
}
